tutorials/FF/dambreak/interFoam-interFoam/Fluid1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -500 500) //0
    (1000 -500 500) //1
    (1000 -500 -500)//2
    (0 -500 -500)//3
    (0 500 500)//4
    (1000 500 500)//5
    (1000 500 -500)//6
    (0 500 -500)//7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    topWall
    {
        type patch;
        faces
        (
        (5 6 7 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
